Tekla.Structures.Analysis.AnalysisMaterial.#ctor
Initializes a new instance of the Tekla.Structures.Analysis.AnalysisMaterial class.

Tekla.Structures.Analysis.AnalysisMaterial.Name
Gets or sets the name of the analysis material.

Tekla.Structures.Analysis.AnalysisMaterial.MaterialType
Gets or sets tThe type of the material.

Tekla.Structures.Analysis.AnalysisMaterial.DampingFactor
Gets or sets the damping factor of the material.

Tekla.Structures.Analysis.AnalysisMaterial.Density
Gets or sets the density of the material.

Tekla.Structures.Analysis.AnalysisMaterial.ModulusOfElasticity
Gets or sets the modulus of elasticity of the analysis material.

Tekla.Structures.Analysis.AnalysisMaterial.PoissonsRatio
Gets or sets the Poisson's ratio of the analysis material.

Tekla.Structures.Analysis.AnalysisMaterial.ThermalDilatation
Gets or sets the thermal dilatation of the analysis material.

Tekla.Structures.Analysis.AnalysisMaterial.Select
Selects an analysis material.
The AnalysisModelName and Name have to be set.